{
    "countries": [
        {
            "label": "challenging",
            "value": "morocco",
            "description": "Morocco aspires to establish a business law that promotes the economic development of the country and settles disputes in an appropriate and effective manner. A new legal framework, based on a clear and predictable structure and content, that is reasonably applied by the economic actors and wisely interpreted by the Moroccan courts. In order to achieve this goal, Morocco has launched, since the early 1990s, a series of legal reforms designed to modernise the legal and regulatory framework for business, amend and modify several legislation and codes including: the commercial code, the investment charter, the intellectual property law, the law on freedom of pricing and competition, the law on public-private partnership, the law on public limited companies and the arbitration act. Furthermore, Morocco's accession to the world trade organization, the ratification of the free trade agreement with the United States and the partnership agreements with the European Union have served as a catalyst for the process of legislative reform. The main projects of reform that have been adopted in recent years are listed hereunder: The adoption of the law on public-private partnership (in 2020); The adoption of the Movable Collateral Act / Personal Property Security Act (in 2019); The adoption of the deconcentration charter (in 2019); The reform of book V of the commercial code on the regulation of corporate insolvency (in 2018); The reform of law no. 17.95 on public limited companies (in 2019 and 2015); The adoption of law no.104.12 on the freedom of pricing and competition (in 2014); The adoption of Law no. 103.12 relating to credit institutions and similar bodies (in 2014); Similarly, other projects are in progress in order to establish a transparent and predictable investment climate such as: the investment charter. The Moroccan business law is currently experiencing far-reaching changes. Moreover, the long-term efforts made by the country have contributed to establishing a modern business environment for investors by aligning with international standards in some areas."
        },
        {
            "label": "Oppurtinity",
            "value": "uae",
            "description": ""
        },
        {
            "label": "Oppurtinity",
            "value": "uae",
            "description": ""
        }
    ]
}